---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainer.GetRebarContainerIterator
source: html/e3368385-4e90-a01e-9335-18d0bdc75790.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer.GetRebarContainerIterator Method

Returns a Rebar Container Iterator that iterates through the Rebar Container Items.

## Syntax (C#)
```csharp
public RebarContainerIterator GetRebarContainerIterator()
```

## Returns
A Rebar Container Iterator object that can be used to iterate through Rebar Container Items in the collection.